logsource:
  category: custom
  product: windows
detection:
  risky_exec_extensions:
    relation|contains:
      - Process Create
      - Process Start
    dstNode.Image|endswith:
      - .exe
      - .scr
      - .dll
      - .com
      - .bat
      - .vbs
    dstNode.Image|re: '\\.(doc|pdf|xls)\\s*\\.(exe|scr|vbs)$'
    condition: all

  office_file_drop:
    relation|contains:
      - CreateFile
      - WriteFile
    srcNode.Image|contains:
      - winword.exe
      - excel.exe
      - powerpnt.exe
      - outlook.exe
      - chrome.exe
      - firefox.exe
      - iexplore.exe
      - msedge.exe
    dstNode.Path|re: '.*\\Start Menu\\Programs\\Startup\\.*\\.(exe|lnk|vbs|bat|js)$'
    condition: all

  chained_execution:
    relation: Process Create
    srcNode.Image|contains:
      - winword.exe
      - excel.exe
      - powerpnt.exe
    dstNode.Image|contains:
      - cmd.exe
      - powershell.exe
    condition: all

  second_stage_scripting:
    relation: Process Create
    srcNode.Image|contains:
      - cmd.exe
      - powershell.exe
    dstNode.Image|contains:
      - wscript.exe
      - cscript.exe
      - rundll32.exe
    condition: all

  registry_persistence:
    relation: RegSetValue
    dstNode.Key|re: '(?i).*\\\\(Run|RunOnce|Windows|Explorer\\\\Shell Folders|Session Manager).*'
    dstNode.Cmdline|contains:
      - .exe
      - .dll
      - .vbs
      - rundll32
      - powershell
      - cmd
    condition: all

  startup_folder_drop:
    relation|contains:
      - CreateFile
      - WriteFile
    dstNode.Path|re: '.*\\Start Menu\\Programs\\Startup\\.*\\.(exe|lnk|vbs|bat|js)$'
    condition: all

condition: risky_exec_extensions or office_file_drop or chained_execution or second_stage_scripting or registry_persistence or startup_folder_drop
tags:
  - attack.T1547.001
  - persistence
level: high
